2.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://webservices.kazpost.kz/wfpayment/schema">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:SavePaymentSrvRequest>
         <sch:SavePaymentSrvInfo>
            <sch:UsrCode>VKO14_SVETLANA_O</sch:UsrCode>
            <sch:DepCode>000000</sch:DepCode>
            <sch:MunDeaCode>5249</sch:MunDeaCode>
            <!--Optional:-->
            <sch:Data></sch:Data>
            <sch:FIO>сарбиева</sch:FIO>
            <sch:RNN></sch:RNN>
            <!--Optional:-->
            <sch:ResidFl>1</sch:ResidFl>
            <!--Optional:-->
            <sch:PeniaFl>0</sch:PeniaFl>
            <!--Optional:-->
            <sch:KNP>852</sch:KNP>
            <!--Optional:-->
            <sch:AddDtl>COMFL=>0</sch:AddDtl>
            <!--Optional:-->
            <sch:ClientType>100</sch:ClientType>
            <!--Optional:-->
            <sch:PaymentType>1</sch:PaymentType>
            <!--Optional:-->
            <sch:pFinMonUsr></sch:pFinMonUsr>
            <!--Optional:-->
            <sch:pItemKey>14319780</sch:pItemKey>
            <sch:Sum>200</sch:Sum>
         </sch:SavePaymentSrvInfo>
         <sch:MunSrvs>
            <!--1 or more repetitions:-->
            <sch:MunSrv>
               <sch:Code>CELLPHONE</sch:Code>
               <sch:Value>+77789253550</sch:Value>
               <sch:SrvID>644</sch:SrvID>
            </sch:MunSrv>
            <sch:MunSrv>
               <sch:Code>AMOUNT</sch:Code>
               <sch:Value>200</sch:Value>
               <sch:SrvID>644</sch:SrvID>
            </sch:MunSrv>
            <sch:MunSrv>
               <sch:Code>AW_CMS</sch:Code>
               <sch:Value>20</sch:Value>
               <sch:SrvID>644</sch:SrvID>
            </sch:MunSrv>
         </sch:MunSrvs>
      </sch:SavePaymentSrvRequest>
   </soapenv:Body>
</soapenv:Envelope>


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <ns2:SavePaymentSrvResponse xmlns:ns2="http://webservices.kazpost.kz/wfpayment/schema">
      <ns2:ColvirReferenceId>1943579277</ns2:ColvirReferenceId>
      <ns2:StatusDoc>FINISH</ns2:StatusDoc>
      <ns2:StatusDocDescription>Исполнен</ns2:StatusDocDescription>
      <ns2:DocNumber>285624797</ns2:DocNumber>
      <ns2:ColvirOrdID>1837925032</ns2:ColvirOrdID>
      <ns2:ColvirOrdDepID>2031</ns2:ColvirOrdDepID>
      <ns2:CodeACR>KZ489261802146530001</ns2:CodeACR>
      <ns2:CodeBCR>KZKOKZKX</ns2:CodeBCR>
      <ns2:NameBCR>АО "КАЗКОММЕРЦБАНК"</ns2:NameBCR>
      <ns2:NameCR>ТОО "QIWI Kazakhstan" (КИВИ Казахстан)</ns2:NameCR>
      <ns2:RnnCR>060640010247</ns2:RnnCR>
      <ns2:KBE>17</ns2:KBE>
      <ns2:KOD>19</ns2:KOD>
      <ns2:KNP>852</ns2:KNP>
      <ns2:Assign>Платежи в пользу  мобильных операторов ТОО "QIWI Kazakhstan"</ns2:Assign>
      <ns2:CshCode>1</ns2:CshCode>
      <ns2:DepAdr>Абылайхана, 139а</ns2:DepAdr>
      <ns2:DepCode>071425</ns2:DepCode>
      <ns2:DepName>СОПС Науалы</ns2:DepName>
      <ns2:Dord>19.01.18</ns2:Dord>
      <ns2:Nomer>0086</ns2:Nomer>
      <ns2:RealTime>16.16</ns2:RealTime>
      <ns2:Ref>1801199587477</ns2:Ref>
      <ns2:SCOM>20,00</ns2:SCOM>
      <ns2:SumAll>220</ns2:SumAll>
      <ns2:Total> ДВЕСТИ тенге 00 тиын</ns2:Total>
      <ns2:UsrFio>Веричева Светлана Вячеславовна</ns2:UsrFio>
      <ns2:ResponseInfo>
        <ns2:ResponseGenTime>2018-01-19T16:16:51.762+06:00</ns2:ResponseGenTime>
        <ns2:ResponseCode>0</ns2:ResponseCode>
        <ns2:ResponseText>success</ns2:ResponseText>
      </ns2:ResponseInfo>
    </ns2:SavePaymentSrvResponse>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

